app/views/tickets/show.html.haml

SELECT `messages`.* FROM `messages` WHERE `messages`.`ticket_id` = 20
---

- @ticket.messages.each do |message|