app/controllers/tickets_controller.rb

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`key` = 'AA' LIMIT 1
SELECT `messages`.* FROM `messages` WHERE ( body REGEXP 'AAA' )
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 89 LIMIT 1
SELECT `departments`.* FROM `departments` WHERE `departments`.`id` = 1 LIMIT 1
SELECT `statuses`.* FROM `statuses` WHERE ( name REGEXP 'hold' ) LIMIT 1
SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`department_id` = 1
---
  def index
    if current_user
      if params[:search]
        @tickets = []
        ticket = Ticket.find_by_key(params[:search])
        @tickets << ticket if ticket
        tickets = Ticket.get_by_subject(params[:search])
        @tickets += tickets
        messages = Message.get_by_keyword(params[:search])
        messages.each{|m| @tickets << m.ticket}
        @tickets = @tickets.uniq {|t| t.id}
      else
        @tickets = case params[:status]
          when 'mytickets'
            current_user.department.tickets.find_all{|t| t.owner_id == current_user.id}

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`key` IS NULL LIMIT 1
---
  def show
    @ticket = params[:key] ? Ticket.find_by_key(params[:key]) : Ticket.find_by_id(params[:id])

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`confirmation_key` = '5e495860969ec80ae8025f959a395aa2' LIMIT 1
---
  def confirm
    @ticket = Ticket.find_by_confirmation_key params[:conf_key]